In [ ]:
import pandas as pd
df_edu = pd.read_csv("DATA/MSOA-Highest level of qualification.csv")
df_edu.head()

Index(['Middle layer Super Output Areas Code',
       'Middle layer Super Output Areas',
       'Highest level of qualification (8 categories) Code',
       'Highest level of qualification (8 categories)', 'Observation'],
      dtype='object')

,Middle layer Super Output Areas Code,Middle layer Super Output Areas,Highest level of qualification (8 categories) Code,Highest level of qualification (8 categories),Observation
0,E02000001,City of London 001,-8,Does not apply,579
1,E02000001,City of London 001,0,No qualifications,529
2,E02000001,City of London 001,1,Level 1 and entry level qualifications: 1 to 4...,223
3,E02000001,City of London 001,2,Level 2 qualifications: 5 or more GCSEs (A* to...,392
4,E02000001,City of London 001,3,Apprenticeship,80

In [ ]:
# rename
df_edu = df_edu.rename(columns={
    'Middle layer Super Output Areas Code': 'MSOA',
    'Highest level of qualification (8 categories)': 'qualification',
    'Observation': 'count'
})

In [ ]:
# change to numeric 
df_edu['count'] = pd.to_numeric(df_edu['count'], errors='coerce')

In [ ]:
# exclude "Does not apply"
valid_rows = df_edu[df_edu['qualification'] != 'Does not apply']

# count the number of high edu
high_edu_label = 'Level 4 qualifications or above: degree (BA, BSc), higher degree (MA, PhD, PGCE), NVQ level 4 to 5, HNC, HND, RSA Higher Diploma, BTEC Higher level, professional qualifications (for example, teaching, nursing, accountancy)'
high_edu = valid_rows[valid_rows['qualification'] == high_edu_label].groupby('MSOA')['count'].sum()

In [ ]:
# count total edu(excludedoes not apply)
total = valid_rows.groupby('MSOA')['count'].sum()

In [ ]:
# calculate the percent of high edu
df_edu_clean = pd.DataFrame({
    'higher_education_percent': (high_edu / total) * 100
}).reset_index()

In [ ]:
# output
df_edu_clean.head()
df_edu_clean.to_csv("cleaned/higher_edu_cleaned.csv", index=False)

        MSOA  higher_education_percent
0  E02000001                 74.181864
1  E02000002                 30.910610
2  E02000003                 34.015143
3  E02000004                 30.743180
4  E02000005                 33.783953